app/Models/C1ac1Model.php

SELECT *
FROM `tbl_c1`
WHERE `code` = 'ac1'
AND `type` = 'table'
AND `c1tID` = '1'
---
    public function getac1($c1tID){

        $query =  $this->db->table($this->tblc1)->where(array('code' => 'ac1', 'type' => 'table', 'c1tID' => $c1tID))->get();

SELECT *
FROM `tbl_c1`
WHERE `code` = 'ac1'
AND `type` = 'nameap'
AND `c1tID` = '1'
---
    public function getnameap($c1tID){

        $query =  $this->db->table($this->tblc1)->where(array('code' => 'ac1', 'type' => 'nameap', 'c1tID' => $c1tID))->get();