app/Models/C1ac4Model.php

SELECT *
FROM `tbl_c1`
WHERE `type` = 'table'
AND `code` = 'ac4'
AND `c1tID` = '4'
---
    public function getac4($c1tID){

        $query = $this->db->table($this->tblc1)->where(array('type' => 'table', 'code' => 'ac4', 'c1tID' => $c1tID))->get();

SELECT *
FROM `tbl_c1`
WHERE `type` = 'ppr1'
AND `code` = 'ac4'
AND `c1tID` = '4'
---
    public function getppr1($c1tID){

        $query = $this->db->table($this->tblc1)->where(array('type' => 'ppr1', 'code' => 'ac4', 'c1tID' => $c1tID))->get();

SELECT *
FROM `tbl_c1`
WHERE `type` = 'ppr2'
AND `code` = 'ac4'
AND `c1tID` = '4'
---
    public function getppr2($c1tID){

        $query = $this->db->table($this->tblc1)->where(array('type' => 'ppr2', 'code' => 'ac4', 'c1tID' => $c1tID))->get();

UPDATE `tbl_c1` SET `question` = '<p>1.	Developments in the business during the period;</p>', `comment` = 'none', `updated_on` = '2024-03-12 22:05:06'
WHERE `acID` = '76'
---
    public function updateac4questions($req){

        $data = [
            'question' => $req['question'],
            'comment' => $req['comment'],
            'updated_on' => $this->date.' '.$this->time
        ];
        if($this->db->table($this->tblc1)->where('acID', $req['c1ID'])->update($data)){