app/Models/C1ac5Model.php

    public function getresult($c1tID){

        $query = $this->db->table($this->tblc1)->where(array('type' => 'result', 'code' => 'ac5', 'c1tID' => $c1tID))->get();
---
SELECT *
FROM `tbl_c1`
WHERE `type` = 'result'
AND `code` = 'ac5'
AND `c1tID` = '5'

    public function getconclusion($c1tID){

        $query = $this->db->table($this->tblc1)->where(array('type' => 'conclusion', 'code' => 'ac5', 'c1tID' => $c1tID))->get();
---
SELECT *
FROM `tbl_c1`
WHERE `type` = 'conclusion'
AND `code` = 'ac5'
AND `c1tID` = '5'