app/Models/C2B2Model.php

    public function getquestionsdata($code,$c2tID){

        $query = $this->db->table($this->tblc2)->where(array('type' => $code, 'code' => $code, 'c2tID' => $c2tID))->get();
---
SELECT *
FROM `tbl_c2`
WHERE `type` = '2.18.3 S2-3'
AND `code` = '2.18.3 S2-3'
AND `c2tID` = '39'

    public function savequestions($req){

        $this->db->table($this->tblc2)->where(array('type' => $req['part'], 'code' => $req['code'], 'c2tID' => $req['c2tID']))->delete();

        foreach($req['question'] as $i => $val){

            $data = [
                'question' => $req['question'][$i],
                'extent' => $req['extent'][$i],
                'reference' => $req['reference'][$i],
                'initials' => $req['initials'][$i],
                'type' =>  $req['part'],
                'code' =>  $req['code'],
                'c2tID' => $req['c2tID'],
                'status' => 'Active',
                'updated_on' => $this->date.' '.$this->time
            ];
            $this->db->table($this->tblc2)->insert($data);
---
DELETE FROM `tbl_c2`
WHERE `type` = '2.19.2 U2-2'
AND `code` = '2.19.2 U2-2'
AND `c2tID` = '42'
INSERT INTO `tbl_c2` (`question`, `extent`, `reference`, `initials`, `type`, `code`, `c2tID`, `status`, `updated_on`) VALUES ('<p>1.	Obtain access to previous auditor’s working papers to assist in the audit of comparatives and opening balances.</p>', '', '', '', '2.19.2 U2-2', '2.19.2 U2-2', '42', 'Active', '2024-03-23 12:05:47')

    public function activeinactiveac2($req){

        $query = $this->db->table($this->tblc2)->where('acID', $req['c2ID'])->get();
        $r = $query->getRowArray();
        $stat = '';
        if($r['status'] == 'Active'){
            $stat = 'Inactive';
        }else{
            $stat = 'Active';
        }
        $data = [
            'status' => $stat,
            'updated_on' => $this->date.' '.$this->time
        ];
        if($this->db->table($this->tblc2)->where('acID', $req['c2ID'])->update($data)){
---
SELECT *
FROM `tbl_c2`
WHERE `acID` = '1162'
UPDATE `tbl_c2` SET `status` = 'Active', `updated_on` = '2024-03-21 14:59:31'
WHERE `acID` = '1162'