app/Models/Chapter1Model.php

    public function getac1eqr($code,$c1tID){

        $query =  $this->db->table($this->tblc1)->where(array('code' => $code, 'type' => 'eqr', 'c1tID' => $c1tID))->get();
        return $query->getRowArray();
---
SELECT *
FROM `tbl_c1`
WHERE `code` = 'AC1'
AND `type` = 'cacf'
AND `c1tID` = '1'
SELECT *
FROM `tbl_c1`
WHERE `code` = 'AC1'
AND `type` = 'eqr'
AND `c1tID` = '1'

    public function saveac1($req){

        $this->db->table($this->tblc1)->where(array('type' => $req['part'], 'code' => $req['code'], 'c1tID' => $req['c1tID']))->delete();
        foreach($req['question'] as $i => $val){
            $data = [
                'question'      => $req['question'][$i],
                'yesno'         => $req['yesno'][$i],
                'comment'       => $req['comment'][$i],
                'code'          => $req['code'],
                'c1tID'         => $req['c1tID'],
                'type'          => $req['part'],
                'status'        => 'Active',
                'added_on'      => $this->date.' '.$this->time
            ];
            $this->db->table($this->tblc1)->insert($data);
---
DELETE FROM `tbl_c1`
WHERE `type` = 'cacf'
AND `code` = 'AC1'
AND `c1tID` = '1'
INSERT INTO `tbl_c1` (`question`, `yesno`, `comment`, `code`, `c1tID`, `type`, `status`, `added_on`) VALUES ('<p>Have the terms of engagement not yet been agreed?</p>\r\n<i>\r\n    <p>If any of the following factors are relevant to this audit assignment, a new letter of engagement should be issued:</p>\r\n    <ul>\r\n        <li>A recent change of senior management;</li>\r\n        <li>A significant change in ownership; </li>\r\n        <li>A change in the financial reporting framework adopted in the preparation of the financial statements; or</li>\r\n        <li>A change in other reporting requirements.</li>\r\n    </ul>\r\n\r\n</i>\r\n', '', 'None', 'AC1', '1', 'cacf', 'Active', '2024-04-08 14:31:04')

    public function saveac4ppr($req){

        $this->db->table($this->tblc1)->where(array('type' => $req['part'], 'code' => $req['code'], 'c1tID' => $req['c1tID']))->delete();
---
DELETE FROM `tbl_c1`
WHERE `type` = 'genmat'
AND `code` = 'AC3'
AND `c1tID` = '3'

    public function saveac4($req){

        $this->db->table($this->tblc1)->where(array('type' => $req['part'], 'code' => $req['code'], 'c1tID' => $req['c1tID']))->delete();
        foreach($req['question'] as $i => $val){
            $data = [
                'question'      => $req['question'][$i],
                'comment'       => $req['comment'][$i],
                'code'          => $req['code'],
                'c1tID'         => $req['c1tID'],
                'type'          => $req['part'],
                'status'        => 'Active',
                'added_on'      => $this->date.' '.$this->time
            ];
            $this->db->table($this->tblc1)->insert($data);
---
INSERT INTO `tbl_c1` (`question`, `yesno`, `comment`, `code`, `c1tID`, `type`, `status`, `added_on`) VALUES ('<p>Is there information about the client’s business including, for example:</p>\r\n<ul>\r\n    <li>description of the nature of the business;</li>\r\n    <li>details of the products or services sold;</li>\r\n    <li>details of competitors;</li>\r\n    <li>industry information (including: general trends, trade restrictions, government policies and grants etc.);</li>\r\n    <li>key suppliers;</li>\r\n    <li>key customers; </li>\r\n    <li>locations; </li>\r\n    <li>client’s risk assessment process, including consideration of business risks and how they are addressed <i>(this is a key ISA requirement)</i></li>\r\n    <li>details of any plans for the future (including objectives and strategies of the business)?</li>\r\n</ul>', 'YES', 'None', 'AC3', '3', 'genmat', 'Active', '2024-04-08 19:44:32')