app/Models/Chapter2Model.php

SELECT *
FROM `tbl_c2`
WHERE `type` = '2.1 B2'
AND `code` = '2.1 B2'
AND `c2tID` = '14'
---
    public function getquestionsdata($code,$c2tID){

        $query = $this->db->table($this->tblc2)->where(array('type' => $code, 'code' => $code, 'c2tID' => $c2tID))->get();
        return $query->getResultArray();

DELETE FROM `tbl_c2`
WHERE `type` = '2.19.1 U2-1'
AND `code` = '2.19.1 U2-1'
AND `c2tID` = '41'
INSERT INTO `tbl_c2` (`question`, `extent`, `reference`, `initials`, `type`, `code`, `c2tID`, `status`, `updated_on`) VALUES ('<p>Each individual section of the audit file should confirm that the current year figures have been agreed to the trial balance and that comparative figures have been agreed to the prior period’s financial statements. Ensure that this has been undertaken.</p>\r\n', '', '', '', '2.19.1 U2-1', '2.19.1 U2-1', '41', 'Active', '2024-04-10 15:30:47')
---
    public function savequestions($req){

        $this->db->table($this->tblc2)->where(array('type' => $req['part'], 'code' => $req['code'], 'c2tID' => $req['c2tID']))->delete();
        foreach($req['question'] as $i => $val){
            $data = [
                'question'      => $req['question'][$i],
                'extent'        => $req['extent'][$i],
                'reference'     => $req['reference'][$i],
                'initials'      => $req['initials'][$i],
                'type'          =>  $req['part'],
                'code'          =>  $req['code'],
                'c2tID'         => $req['c2tID'],
                'status'        => 'Active',
                'updated_on'    => $this->date.' '.$this->time
            ];
            $this->db->table($this->tblc2)->insert($data);