app/Models/ClientModel.php

    public function editclient($cID){

        $query = $this->db->table($this->tblc)->where('cID', $cID)->get();
---
SELECT *
FROM `tbl_clients`
WHERE `cID` = '8'

            break;

            case 'c3':
                $check = $this->db->table($this->tblc3d)->where(array('mtID' => $req['mtID'], 'cID' => $req['cID']))->get()->getNumRows();
---
SELECT *
FROM `tbl_c3`
WHERE `mtID` = '1'