app/Models/FirmsModel.php

    public function verifyfirm($uID){

        if($this->db->table($this->tbluser)->where('userID', $uID)->update(array('verified' => 'Yes', 'email_verify_at' => $this->date.' '.$this->time, 'updated_on' => $this->date.' '.$this->time))){
---
UPDATE `tbl_users` SET `verified` = 'Yes', `email_verify_at` = '2024-04-03 14:58:00', `updated_on` = '2024-04-03 14:58:00'
WHERE `userID` = '6'