app/Models/UserModel.php

UPDATE `tbl_users` SET `status` = 'Inactive', `updated_on` = '2024-05-31 17:30:29'
WHERE `userID` = '10'
SELECT *
FROM `tbl_users`
WHERE `userID` = '10'
---
    public function acin($duID){

        $query = $this->db->table($this->tblu)->where('userID', $duID)->get();
        $r = $query->getRowArray();
        $stat = '';
        if($r['status'] == 'Active'){
            $stat = 'Inactive';
        }else{
            $stat = 'Active';
        }
        $data = [
            'status' => $stat,
            'updated_on' => $this->date.' '.$this->time
        ];
        if($this->db->table($this->tblu)->where('userID', $duID)->update($data)){